/*********************************************************************
 * \file   PlayerWepon.cpp
 * \brief  
 * 
 * \author Harukichimaru
 * \date   February 2025
 * \note   
 *********************************************************************/
#include "PlayerWepon.h"

///=============================================================================
///						初期化
void PlayerWepon::Initialize() {
	//========================================
	// 当たり判定との同期
	BaseObject::Initialize(transform.translate, 0.2f);
}

///=============================================================================
///						更新
void PlayerWepon::Update() {
	//========================================
	// 当たり判定との同期
	BaseObject::Update(transform.translate);
}

///=============================================================================
///						描画
void PlayerWepon::Draw() {
}

///=============================================================================
///						当たった時
void PlayerWepon::OnCollisionEnter(BaseObject *other) {
}

///=============================================================================
///						当たっている時
void PlayerWepon::OnCollisionStay(BaseObject *other) {
}

///=============================================================================
///						あたり判定から離れた時
void PlayerWepon::OnCollisionExit(BaseObject *other) {
}
