/*********************************************************************
 * \file   MaruRhythm.cpp
 * \brief
 *
 * \author Harukichimaru
 * \date   January 2025
 * \note
 *********************************************************************/
#include "MaruRhythm.h"

///=============================================================================
///						初期化
void MaruRhythm::Initialize() {
	///--------------------------------------------------------------
	///						 フレームワーク初期化
	MRFramework::Initialize();
}

///=============================================================================
///						終了処理
void MaruRhythm::Finalize() {
	CameraManager::GetInstance()->Finalize();///
	//========================================
	// フレームワークの終了処理
	MRFramework::Finalize();
}

///=============================================================================
///						更新
void MaruRhythm::Update() {
	//========================================
	// 更新処理
	MRFramework::Update();

	///--------------------------------------------------------------
	///						更新処理
	//========================================
	// カメラの更新
	CameraManager::GetInstance()->UpdateAll();

	//========================================
	// ImGuiの更新
	MRFramework::ImGuiPreDraw();
	//↓この間に書け!!!
	//↑
	MRFramework::ImGuiPostDraw();
}

///=============================================================================
///						描画
void MaruRhythm::Draw() {
	//========================================
	// ループ前処理
	MRFramework::FrameworkPreDraw();

	//========================================
	//3Dオブジェクト共通描画設定
	MRFramework::Object3DCommonDraw();

	//========================================
	// 2Dオブジェクト共通描画設定
	MRFramework::Object2DCommonDraw();

	//========================================
	//パーティクル共通描画設定
	MRFramework::ParticleCommonDraw();

	//========================================
	// ループ後処理
	MRFramework::FrameworkPostDraw();
}
