///===================================================================///
///							Spriteクラス.h
///===================================================================///
//NOTE:スプライト1枚分のクラス
//#include "SpriteManager.h"

#pragma once
class SpriteManager;
class Sprite {
	///----------------------------------------------------///
	///						メンバ関数
	///----------------------------------------------------///
public:

	/// <summary>
	/// 初期化
	/// </summary>
	void Initialize(SpriteManager* spriteManager);





	///----------------------------------------------------///
	///						メンバ変数
	///----------------------------------------------------///
private:
	/// ===スプライト共通部Pointer=== ///
	SpriteManager* spriteManager_ = nullptr;





};

