///===============================================================///
/// 
///Spriteクラス.h
/// 
///===============================================================///
//NOTE:スプライト1枚分のクラス
#include "SpriteManager.h"

#pragma once
class SpriteManager;
class Sprite {
public:
	///-------------------------------------------/// 
	///メンバ関数
	///-------------------------------------------///

	/// <summary>
	/// 初期化
	/// </summary>
	void Initialize(SpriteManager* spriteManager);






private:
	///-------------------------------------------/// 
	///メンバ変数
	///-------------------------------------------///
	/// ===スプライト共通部Pointer=== ///
	SpriteManager* spriteManager_ = nullptr;





};

